GopalSaraf/Practicals/PSDL/include/proc/pic18f45q43.inc
// Register: T2INPPS
#define T2INPPS T2INPPS
T2INPPS                                  equ 0248h
// bitfield definitions
T2INPPS_PIN_POSN                         equ 0000h
T2INPPS_PIN_POSITION                     equ 0000h
T2INPPS_PIN_SIZE                         equ 0003h
T2INPPS_PIN_LENGTH                       equ 0003h
T2INPPS_PIN_MASK                         equ 0007h
T2INPPS_PORT_POSN                        equ 0003h
T2INPPS_PORT_POSITION                    equ 0003h
T2INPPS_PORT_SIZE                        equ 0002h
T2INPPS_PORT_LENGTH                      equ 0002h
T2INPPS_PORT_MASK                        equ 0018h
T2INPPS_T2INPPS0_POSN                    equ 0000h
T2INPPS_T2INPPS0_POSITION                equ 0000h
T2INPPS_T2INPPS0_SIZE                    equ 0001h
T2INPPS_T2INPPS0_LENGTH                  equ 0001h
T2INPPS_T2INPPS0_MASK                    equ 0001h
T2INPPS_T2INPPS1_POSN                    equ 0001h
T2INPPS_T2INPPS1_POSITION                equ 0001h
T2INPPS_T2INPPS1_SIZE                    equ 0001h
T2INPPS_T2INPPS1_LENGTH                  equ 0001h
T2INPPS_T2INPPS1_MASK                    equ 0002h
T2INPPS_T2INPPS2_POSN                    equ 0002h
T2INPPS_T2INPPS2_POSITION                equ 0002h
T2INPPS_T2INPPS2_SIZE                    equ 0001h
T2INPPS_T2INPPS2_LENGTH                  equ 0001h
T2INPPS_T2INPPS2_MASK                    equ 0004h
T2INPPS_T2INPPS3_POSN                    equ 0003h
T2INPPS_T2INPPS3_POSITION                equ 0003h
T2INPPS_T2INPPS3_SIZE                    equ 0001h
T2INPPS_T2INPPS3_LENGTH                  equ 0001h
T2INPPS_T2INPPS3_MASK                    equ 0008h
T2INPPS_T2INPPS4_POSN                    equ 0004h
T2INPPS_T2INPPS4_POSITION                equ 0004h
T2INPPS_T2INPPS4_SIZE                    equ 0001h
T2INPPS_T2INPPS4_LENGTH                  equ 0001h
T2INPPS_T2INPPS4_MASK                    equ 0010h
T2INPPS_T2INPPS_POSN                     equ 0000h
T2INPPS_T2INPPS_POSITION                 equ 0000h
T2INPPS_T2INPPS_SIZE                     equ 0005h
T2INPPS_T2INPPS_LENGTH                   equ 0005h
T2INPPS_T2INPPS_MASK                     equ 001Fh

// Register: T4INPPS
#define T4INPPS T4INPPS
T4INPPS                                  equ 0249h
// bitfield definitions
T4INPPS_PIN_POSN                         equ 0000h
T4INPPS_PIN_POSITION                     equ 0000h
T4INPPS_PIN_SIZE                         equ 0003h
T4INPPS_PIN_LENGTH                       equ 0003h
T4INPPS_PIN_MASK                         equ 0007h
T4INPPS_PORT_POSN                        equ 0003h
T4INPPS_PORT_POSITION                    equ 0003h
T4INPPS_PORT_SIZE                        equ 0002h
T4INPPS_PORT_LENGTH                      equ 0002h
T4INPPS_PORT_MASK                        equ 0018h
T4INPPS_T4INPPS0_POSN                    equ 0000h
T4INPPS_T4INPPS0_POSITION                equ 0000h
T4INPPS_T4INPPS0_SIZE                    equ 0001h
T4INPPS_T4INPPS0_LENGTH                  equ 0001h
T4INPPS_T4INPPS0_MASK                    equ 0001h
T4INPPS_T4INPPS1_POSN                    equ 0001h
T4INPPS_T4INPPS1_POSITION                equ 0001h
T4INPPS_T4INPPS1_SIZE                    equ 0001h
T4INPPS_T4INPPS1_LENGTH                  equ 0001h
T4INPPS_T4INPPS1_MASK                    equ 0002h
T4INPPS_T4INPPS2_POSN                    equ 0002h
T4INPPS_T4INPPS2_POSITION                equ 0002h
T4INPPS_T4INPPS2_SIZE                    equ 0001h
T4INPPS_T4INPPS2_LENGTH                  equ 0001h
T4INPPS_T4INPPS2_MASK                    equ 0004h
T4INPPS_T4INPPS3_POSN                    equ 0003h
T4INPPS_T4INPPS3_POSITION                equ 0003h
T4INPPS_T4INPPS3_SIZE                    equ 0001h
T4INPPS_T4INPPS3_LENGTH                  equ 0001h
T4INPPS_T4INPPS3_MASK                    equ 0008h
T4INPPS_T4INPPS4_POSN                    equ 0004h
T4INPPS_T4INPPS4_POSITION                equ 0004h
T4INPPS_T4INPPS4_SIZE                    equ 0001h
T4INPPS_T4INPPS4_LENGTH                  equ 0001h
T4INPPS_T4INPPS4_MASK                    equ 0010h
T4INPPS_T4INPPS_POSN                     equ 0000h
T4INPPS_T4INPPS_POSITION                 equ 0000h
T4INPPS_T4INPPS_SIZE                     equ 0005h
T4INPPS_T4INPPS_LENGTH                   equ 0005h
T4INPPS_T4INPPS_MASK                     equ 001Fh

// Register: T6INPPS
#define T6INPPS T6INPPS
T6INPPS                                  equ 024Ah
// bitfield definitions
T6INPPS_PIN_POSN                         equ 0000h
T6INPPS_PIN_POSITION                     equ 0000h
T6INPPS_PIN_SIZE                         equ 0003h
T6INPPS_PIN_LENGTH                       equ 0003h
T6INPPS_PIN_MASK                         equ 0007h
T6INPPS_PORT_POSN                        equ 0003h
T6INPPS_PORT_POSITION                    equ 0003h
T6INPPS_PORT_SIZE                        equ 0002h
T6INPPS_PORT_LENGTH                      equ 0002h
T6INPPS_PORT_MASK                        equ 0018h
T6INPPS_T6INPPS0_POSN                    equ 0000h
T6INPPS_T6INPPS0_POSITION                equ 0000h
T6INPPS_T6INPPS0_SIZE                    equ 0001h
T6INPPS_T6INPPS0_LENGTH                  equ 0001h
T6INPPS_T6INPPS0_MASK                    equ 0001h
T6INPPS_T6INPPS1_POSN                    equ 0001h
T6INPPS_T6INPPS1_POSITION                equ 0001h
T6INPPS_T6INPPS1_SIZE                    equ 0001h
T6INPPS_T6INPPS1_LENGTH                  equ 0001h
T6INPPS_T6INPPS1_MASK                    equ 0002h
T6INPPS_T6INPPS2_POSN                    equ 0002h
T6INPPS_T6INPPS2_POSITION                equ 0002h
T6INPPS_T6INPPS2_SIZE                    equ 0001h
T6INPPS_T6INPPS2_LENGTH                  equ 0001h
T6INPPS_T6INPPS2_MASK                    equ 0004h
T6INPPS_T6INPPS3_POSN                    equ 0003h
T6INPPS_T6INPPS3_POSITION                equ 0003h
T6INPPS_T6INPPS3_SIZE                    equ 0001h
T6INPPS_T6INPPS3_LENGTH                  equ 0001h
T6INPPS_T6INPPS3_MASK                    equ 0008h
T6INPPS_T6INPPS4_POSN                    equ 0004h
T6INPPS_T6INPPS4_POSITION                equ 0004h
T6INPPS_T6INPPS4_SIZE                    equ 0001h
T6INPPS_T6INPPS4_LENGTH                  equ 0001h
T6INPPS_T6INPPS4_MASK                    equ 0010h
T6INPPS_T6INPPS_POSN                     equ 0000h
T6INPPS_T6INPPS_POSITION                 equ 0000h
T6INPPS_T6INPPS_SIZE                     equ 0005h
T6INPPS_T6INPPS_LENGTH                   equ 0005h
T6INPPS_T6INPPS_MASK                     equ 001Fh

// Register: CCP1PPS
#define CCP1PPS CCP1PPS
CCP1PPS                                  equ 024Fh
// bitfield definitions
CCP1PPS_PIN_POSN                         equ 0000h
CCP1PPS_PIN_POSITION                     equ 0000h
CCP1PPS_PIN_SIZE                         equ 0003h
CCP1PPS_PIN_LENGTH                       equ 0003h
CCP1PPS_PIN_MASK                         equ 0007h
CCP1PPS_PORT_POSN                        equ 0003h
CCP1PPS_PORT_POSITION                    equ 0003h
CCP1PPS_PORT_SIZE                        equ 0003h
CCP1PPS_PORT_LENGTH                      equ 0003h
CCP1PPS_PORT_MASK                        equ 0038h
CCP1PPS_CCP1PPS0_POSN                    equ 0000h
CCP1PPS_CCP1PPS0_POSITION                equ 0000h
CCP1PPS_CCP1PPS0_SIZE                    equ 0001h
CCP1PPS_CCP1PPS0_LENGTH                  equ 0001h
CCP1PPS_CCP1PPS0_MASK                    equ 0001h
CCP1PPS_CCP1PPS1_POSN                    equ 0001h
CCP1PPS_CCP1PPS1_POSITION                equ 0001h
CCP1PPS_CCP1PPS1_SIZE                    equ 0001h
CCP1PPS_CCP1PPS1_LENGTH                  equ 0001h
CCP1PPS_CCP1PPS1_MASK                    equ 0002h
CCP1PPS_CCP1PPS2_POSN                    equ 0002h
CCP1PPS_CCP1PPS2_POSITION                equ 0002h
CCP1PPS_CCP1PPS2_SIZE                    equ 0001h
CCP1PPS_CCP1PPS2_LENGTH                  equ 0001h
CCP1PPS_CCP1PPS2_MASK                    equ 0004h
CCP1PPS_CCP1PPS3_POSN                    equ 0003h
CCP1PPS_CCP1PPS3_POSITION                equ 0003h
CCP1PPS_CCP1PPS3_SIZE                    equ 0001h
CCP1PPS_CCP1PPS3_LENGTH                  equ 0001h
CCP1PPS_CCP1PPS3_MASK                    equ 0008h
CCP1PPS_CCP1PPS4_POSN                    equ 0004h
CCP1PPS_CCP1PPS4_POSITION                equ 0004h
CCP1PPS_CCP1PPS4_SIZE                    equ 0001h
CCP1PPS_CCP1PPS4_LENGTH                  equ 0001h
CCP1PPS_CCP1PPS4_MASK                    equ 0010h
CCP1PPS_CCP1PPS5_POSN                    equ 0005h
CCP1PPS_CCP1PPS5_POSITION                equ 0005h
CCP1PPS_CCP1PPS5_SIZE                    equ 0001h
CCP1PPS_CCP1PPS5_LENGTH                  equ 0001h
CCP1PPS_CCP1PPS5_MASK                    equ 0020h
CCP1PPS_CCP1PPS_POSN                     equ 0000h
CCP1PPS_CCP1PPS_POSITION                 equ 0000h
CCP1PPS_CCP1PPS_SIZE                     equ 0006h
CCP1PPS_CCP1PPS_LENGTH                   equ 0006h
CCP1PPS_CCP1PPS_MASK                     equ 003Fh

// Register: CCP2PPS
#define CCP2PPS CCP2PPS
CCP2PPS                                  equ 0250h
// bitfield definitions
CCP2PPS_PIN_POSN                         equ 0000h
CCP2PPS_PIN_POSITION                     equ 0000h
CCP2PPS_PIN_SIZE                         equ 0003h
CCP2PPS_PIN_LENGTH                       equ 0003h
CCP2PPS_PIN_MASK                         equ 0007h
CCP2PPS_PORT_POSN                        equ 0003h
CCP2PPS_PORT_POSITION                    equ 0003h
CCP2PPS_PORT_SIZE                        equ 0003h
CCP2PPS_PORT_LENGTH                      equ 0003h
CCP2PPS_PORT_MASK                        equ 0038h
CCP2PPS_CCP2PPS0_POSN                    equ 0000h
CCP2PPS_CCP2PPS0_POSITION                equ 0000h
CCP2PPS_CCP2PPS0_SIZE                    equ 0001h
CCP2PPS_CCP2PPS0_LENGTH                  equ 0001h
CCP2PPS_CCP2PPS0_MASK                    equ 0001h
CCP2PPS_CCP2PPS1_POSN                    equ 0001h
CCP2PPS_CCP2PPS1_POSITION                equ 0001h
CCP2PPS_CCP2PPS1_SIZE                    equ 0001h
CCP2PPS_CCP2PPS1_LENGTH                  equ 0001h
CCP2PPS_CCP2PPS1_MASK                    equ 0002h
CCP2PPS_CCP2PPS2_POSN                    equ 0002h
CCP2PPS_CCP2PPS2_POSITION                equ 0002h
CCP2PPS_CCP2PPS2_SIZE                    equ 0001h
CCP2PPS_CCP2PPS2_LENGTH                  equ 0001h
CCP2PPS_CCP2PPS2_MASK                    equ 0004h
CCP2PPS_CCP2PPS3_POSN                    equ 0003h
CCP2PPS_CCP2PPS3_POSITION                equ 0003h
CCP2PPS_CCP2PPS3_SIZE                    equ 0001h
CCP2PPS_CCP2PPS3_LENGTH                  equ 0001h
CCP2PPS_CCP2PPS3_MASK                    equ 0008h
CCP2PPS_CCP2PPS4_POSN                    equ 0004h
CCP2PPS_CCP2PPS4_POSITION                equ 0004h
CCP2PPS_CCP2PPS4_SIZE                    equ 0001h
CCP2PPS_CCP2PPS4_LENGTH                  equ 0001h
CCP2PPS_CCP2PPS4_MASK                    equ 0010h
CCP2PPS_CCP2PPS5_POSN                    equ 0005h
CCP2PPS_CCP2PPS5_POSITION                equ 0005h
CCP2PPS_CCP2PPS5_SIZE                    equ 0001h
CCP2PPS_CCP2PPS5_LENGTH                  equ 0001h
CCP2PPS_CCP2PPS5_MASK                    equ 0020h
CCP2PPS_CCP2PPS_POSN                     equ 0000h
CCP2PPS_CCP2PPS_POSITION                 equ 0000h
CCP2PPS_CCP2PPS_SIZE                     equ 0006h
CCP2PPS_CCP2PPS_LENGTH                   equ 0006h
CCP2PPS_CCP2PPS_MASK                     equ 003Fh

// Register: CCP3PPS
#define CCP3PPS CCP3PPS
CCP3PPS                                  equ 0251h
// bitfield definitions
CCP3PPS_PIN_POSN                         equ 0000h
CCP3PPS_PIN_POSITION                     equ 0000h
CCP3PPS_PIN_SIZE                         equ 0003h
CCP3PPS_PIN_LENGTH                       equ 0003h
CCP3PPS_PIN_MASK                         equ 0007h
CCP3PPS_PORT_POSN                        equ 0003h
CCP3PPS_PORT_POSITION                    equ 0003h
CCP3PPS_PORT_SIZE                        equ 0002h
CCP3PPS_PORT_LENGTH                      equ 0002h
CCP3PPS_PORT_MASK                        equ 0018h
CCP3PPS_CCP3PPS0_POSN                    equ 0000h
CCP3PPS_CCP3PPS0_POSITION                equ 0000h
CCP3PPS_CCP3PPS0_SIZE                    equ 0001h
CCP3PPS_CCP3PPS0_LENGTH                  equ 0001h
CCP3PPS_CCP3PPS0_MASK                    equ 0001h
CCP3PPS_CCP3PPS1_POSN                    equ 0001h
CCP3PPS_CCP3PPS1_POSITION                equ 0001h
CCP3PPS_CCP3PPS1_SIZE                    equ 0001h
CCP3PPS_CCP3PPS1_LENGTH                  equ 0001h
CCP3PPS_CCP3PPS1_MASK                    equ 0002h
CCP3PPS_CCP3PPS2_POSN                    equ 0002h
CCP3PPS_CCP3PPS2_POSITION                equ 0002h
CCP3PPS_CCP3PPS2_SIZE                    equ 0001h
CCP3PPS_CCP3PPS2_LENGTH                  equ 0001h
CCP3PPS_CCP3PPS2_MASK                    equ 0004h
CCP3PPS_CCP3PPS3_POSN                    equ 0003h
CCP3PPS_CCP3PPS3_POSITION                equ 0003h
CCP3PPS_CCP3PPS3_SIZE                    equ 0001h
CCP3PPS_CCP3PPS3_LENGTH                  equ 0001h
CCP3PPS_CCP3PPS3_MASK                    equ 0008h
CCP3PPS_CCP3PPS4_POSN                    equ 0004h
CCP3PPS_CCP3PPS4_POSITION                equ 0004h
CCP3PPS_CCP3PPS4_SIZE                    equ 0001h
CCP3PPS_CCP3PPS4_LENGTH                  equ 0001h
CCP3PPS_CCP3PPS4_MASK                    equ 0010h
CCP3PPS_CCP3PPS_POSN                     equ 0000h
CCP3PPS_CCP3PPS_POSITION                 equ 0000h
CCP3PPS_CCP3PPS_SIZE                     equ 0005h
CCP3PPS_CCP3PPS_LENGTH                   equ 0005h
CCP3PPS_CCP3PPS_MASK                     equ 001Fh

// Register: PWM1ERSPPS
#define PWM1ERSPPS PWM1ERSPPS
PWM1ERSPPS                               equ 0253h
// bitfield definitions
PWM1ERSPPS_PIN_POSN                      equ 0000h
PWM1ERSPPS_PIN_POSITION                  equ 0000h
PWM1ERSPPS_PIN_SIZE                      equ 0003h
PWM1ERSPPS_PIN_LENGTH                    equ 0003h
PWM1ERSPPS_PIN_MASK                      equ 0007h
PWM1ERSPPS_PORT_POSN                     equ 0003h
PWM1ERSPPS_PORT_POSITION                 equ 0003h
PWM1ERSPPS_PORT_SIZE                     equ 0002h
PWM1ERSPPS_PORT_LENGTH                   equ 0002h
PWM1ERSPPS_PORT_MASK                     equ 0018h
PWM1ERSPPS_PWM1ERSPPS_POSN               equ 0000h
PWM1ERSPPS_PWM1ERSPPS_POSITION           equ 0000h
PWM1ERSPPS_PWM1ERSPPS_SIZE               equ 0005h
PWM1ERSPPS_PWM1ERSPPS_LENGTH             equ 0005h
PWM1ERSPPS_PWM1ERSPPS_MASK               equ 001Fh
PWM1ERSPPS_PWM1ERSPPS0_POSN              equ 0000h
PWM1ERSPPS_PWM1ERSPPS0_POSITION          equ 0000h
PWM1ERSPPS_PWM1ERSPPS0_SIZE              equ 0001h
PWM1ERSPPS_PWM1ERSPPS0_LENGTH            equ 0001h
PWM1ERSPPS_PWM1ERSPPS0_MASK              equ 0001h
PWM1ERSPPS_PWM1ERSPPS1_POSN              equ 0001h
PWM1ERSPPS_PWM1ERSPPS1_POSITION          equ 0001h
PWM1ERSPPS_PWM1ERSPPS1_SIZE              equ 0001h
PWM1ERSPPS_PWM1ERSPPS1_LENGTH            equ 0001h
PWM1ERSPPS_PWM1ERSPPS1_MASK              equ 0002h
PWM1ERSPPS_PWM1ERSPPS2_POSN              equ 0002h
PWM1ERSPPS_PWM1ERSPPS2_POSITION          equ 0002h
PWM1ERSPPS_PWM1ERSPPS2_SIZE              equ 0001h
PWM1ERSPPS_PWM1ERSPPS2_LENGTH            equ 0001h
PWM1ERSPPS_PWM1ERSPPS2_MASK              equ 0004h
PWM1ERSPPS_PWM1ERSPPS3_POSN              equ 0003h
PWM1ERSPPS_PWM1ERSPPS3_POSITION          equ 0003h
PWM1ERSPPS_PWM1ERSPPS3_SIZE              equ 0001h
PWM1ERSPPS_PWM1ERSPPS3_LENGTH            equ 0001h
PWM1ERSPPS_PWM1ERSPPS3_MASK              equ 0008h
PWM1ERSPPS_PWM1ERSPPS4_POSN              equ 0004h
PWM1ERSPPS_PWM1ERSPPS4_POSITION          equ 0004h
PWM1ERSPPS_PWM1ERSPPS4_SIZE              equ 0001h
PWM1ERSPPS_PWM1ERSPPS4_LENGTH            equ 0001h
PWM1ERSPPS_PWM1ERSPPS4_MASK              equ 0010h

// Register: PWM2ERSPPS
#define PWM2ERSPPS PWM2ERSPPS
PWM2ERSPPS                               equ 0254h
// bitfield definitions
PWM2ERSPPS_PIN_POSN                      equ 0000h
PWM2ERSPPS_PIN_POSITION                  equ 0000h
PWM2ERSPPS_PIN_SIZE                      equ 0003h
PWM2ERSPPS_PIN_LENGTH                    equ 0003h
PWM2ERSPPS_PIN_MASK                      equ 0007h
PWM2ERSPPS_PORT_POSN                     equ 0003h
PWM2ERSPPS_PORT_POSITION                 equ 0003h
PWM2ERSPPS_PORT_SIZE                     equ 0003h
PWM2ERSPPS_PORT_LENGTH                   equ 0003h
PWM2ERSPPS_PORT_MASK                     equ 0038h
PWM2ERSPPS_PWM2ERSPPS_POSN               equ 0000h
PWM2ERSPPS_PWM2ERSPPS_POSITION           equ 0000h
PWM2ERSPPS_PWM2ERSPPS_SIZE               equ 0006h
PWM2ERSPPS_PWM2ERSPPS_LENGTH             equ 0006h
PWM2ERSPPS_PWM2ERSPPS_MASK               equ 003Fh
PWM2ERSPPS_PWM2ERSPPS0_POSN              equ 0000h
PWM2ERSPPS_PWM2ERSPPS0_POSITION          equ 0000h
PWM2ERSPPS_PWM2ERSPPS0_SIZE              equ 0001h
PWM2ERSPPS_PWM2ERSPPS0_LENGTH            equ 0001h
PWM2ERSPPS_PWM2ERSPPS0_MASK              equ 0001h
PWM2ERSPPS_PWM2ERSPPS1_POSN              equ 0001h
PWM2ERSPPS_PWM2ERSPPS1_POSITION          equ 0001h
PWM2ERSPPS_PWM2ERSPPS1_SIZE              equ 0001h
PWM2ERSPPS_PWM2ERSPPS1_LENGTH            equ 0001h
PWM2ERSPPS_PWM2ERSPPS1_MASK              equ 0002h
PWM2ERSPPS_PWM2ERSPPS2_POSN              equ 0002h
PWM2ERSPPS_PWM2ERSPPS2_POSITION          equ 0002h
PWM2ERSPPS_PWM2ERSPPS2_SIZE              equ 0001h
PWM2ERSPPS_PWM2ERSPPS2_LENGTH            equ 0001h
PWM2ERSPPS_PWM2ERSPPS2_MASK              equ 0004h
PWM2ERSPPS_PWM2ERSPPS3_POSN              equ 0003h
PWM2ERSPPS_PWM2ERSPPS3_POSITION          equ 0003h
PWM2ERSPPS_PWM2ERSPPS3_SIZE              equ 0001h
PWM2ERSPPS_PWM2ERSPPS3_LENGTH            equ 0001h
PWM2ERSPPS_PWM2ERSPPS3_MASK              equ 0008h
PWM2ERSPPS_PWM2ERSPPS4_POSN              equ 0004h
PWM2ERSPPS_PWM2ERSPPS4_POSITION          equ 0004h
PWM2ERSPPS_PWM2ERSPPS4_SIZE              equ 0001h
PWM2ERSPPS_PWM2ERSPPS4_LENGTH            equ 0001h
PWM2ERSPPS_PWM2ERSPPS4_MASK              equ 0010h
PWM2ERSPPS_PWM2ERSPPS5_POSN              equ 0005h
PWM2ERSPPS_PWM2ERSPPS5_POSITION          equ 0005h
PWM2ERSPPS_PWM2ERSPPS5_SIZE              equ 0001h
PWM2ERSPPS_PWM2ERSPPS5_LENGTH            equ 0001h
PWM2ERSPPS_PWM2ERSPPS5_MASK              equ 0020h

// Register: PWM3ERSPPS
#define PWM3ERSPPS PWM3ERSPPS
PWM3ERSPPS                               equ 0255h
// bitfield definitions
PWM3ERSPPS_PIN_POSN                      equ 0000h
PWM3ERSPPS_PIN_POSITION                  equ 0000h
PWM3ERSPPS_PIN_SIZE                      equ 0003h
PWM3ERSPPS_PIN_LENGTH                    equ 0003h
PWM3ERSPPS_PIN_MASK                      equ 0007h
PWM3ERSPPS_PORT_POSN                     equ 0003h
PWM3ERSPPS_PORT_POSITION                 equ 0003h
PWM3ERSPPS_PORT_SIZE                     equ 0002h
PWM3ERSPPS_PORT_LENGTH                   equ 0002h
PWM3ERSPPS_PORT_MASK                     equ 0018h
PWM3ERSPPS_PWM3ERSPPS_POSN               equ 0000h
PWM3ERSPPS_PWM3ERSPPS_POSITION           equ 0000h
PWM3ERSPPS_PWM3ERSPPS_SIZE               equ 0005h
PWM3ERSPPS_PWM3ERSPPS_LENGTH             equ 0005h
PWM3ERSPPS_PWM3ERSPPS_MASK               equ 001Fh
PWM3ERSPPS_PWM3ERSPPS0_POSN              equ 0000h
PWM3ERSPPS_PWM3ERSPPS0_POSITION          equ 0000h
PWM3ERSPPS_PWM3ERSPPS0_SIZE              equ 0001h
PWM3ERSPPS_PWM3ERSPPS0_LENGTH            equ 0001h
PWM3ERSPPS_PWM3ERSPPS0_MASK              equ 0001h
PWM3ERSPPS_PWM3ERSPPS1_POSN              equ 0001h
PWM3ERSPPS_PWM3ERSPPS1_POSITION          equ 0001h
PWM3ERSPPS_PWM3ERSPPS1_SIZE              equ 0001h
PWM3ERSPPS_PWM3ERSPPS1_LENGTH            equ 0001h
PWM3ERSPPS_PWM3ERSPPS1_MASK              equ 0002h
PWM3ERSPPS_PWM3ERSPPS2_POSN              equ 0002h
PWM3ERSPPS_PWM3ERSPPS2_POSITION          equ 0002h
PWM3ERSPPS_PWM3ERSPPS2_SIZE              equ 0001h
PWM3ERSPPS_PWM3ERSPPS2_LENGTH            equ 0001h
PWM3ERSPPS_PWM3ERSPPS2_MASK              equ 0004h
PWM3ERSPPS_PWM3ERSPPS3_POSN              equ 0003h
PWM3ERSPPS_PWM3ERSPPS3_POSITION          equ 0003h
PWM3ERSPPS_PWM3ERSPPS3_SIZE              equ 0001h
PWM3ERSPPS_PWM3ERSPPS3_LENGTH            equ 0001h
PWM3ERSPPS_PWM3ERSPPS3_MASK              equ 0008h
PWM3ERSPPS_PWM3ERSPPS4_POSN              equ 0004h
PWM3ERSPPS_PWM3ERSPPS4_POSITION          equ 0004h
PWM3ERSPPS_PWM3ERSPPS4_SIZE              equ 0001h
PWM3ERSPPS_PWM3ERSPPS4_LENGTH            equ 0001h
PWM3ERSPPS_PWM3ERSPPS4_MASK              equ 0010h

