GopalSaraf/Practicals/PSDL/include/proc/pic18f45q43.inc
// Register: ADACCL
#define ADACCL ADACCL
ADACCL                                   equ 03E3h
// bitfield definitions
ADACCL_ACC_POSN                          equ 0000h
ADACCL_ACC_POSITION                      equ 0000h
ADACCL_ACC_SIZE                          equ 0008h
ADACCL_ACC_LENGTH                        equ 0008h
ADACCL_ACC_MASK                          equ 00FFh
ADACCL_ADACC0_POSN                       equ 0000h
ADACCL_ADACC0_POSITION                   equ 0000h
ADACCL_ADACC0_SIZE                       equ 0001h
ADACCL_ADACC0_LENGTH                     equ 0001h
ADACCL_ADACC0_MASK                       equ 0001h
ADACCL_ADACC1_POSN                       equ 0001h
ADACCL_ADACC1_POSITION                   equ 0001h
ADACCL_ADACC1_SIZE                       equ 0001h
ADACCL_ADACC1_LENGTH                     equ 0001h
ADACCL_ADACC1_MASK                       equ 0002h
ADACCL_ADACC2_POSN                       equ 0002h
ADACCL_ADACC2_POSITION                   equ 0002h
ADACCL_ADACC2_SIZE                       equ 0001h
ADACCL_ADACC2_LENGTH                     equ 0001h
ADACCL_ADACC2_MASK                       equ 0004h
ADACCL_ADACC3_POSN                       equ 0003h
ADACCL_ADACC3_POSITION                   equ 0003h
ADACCL_ADACC3_SIZE                       equ 0001h
ADACCL_ADACC3_LENGTH                     equ 0001h
ADACCL_ADACC3_MASK                       equ 0008h
ADACCL_ADACC4_POSN                       equ 0004h
ADACCL_ADACC4_POSITION                   equ 0004h
ADACCL_ADACC4_SIZE                       equ 0001h
ADACCL_ADACC4_LENGTH                     equ 0001h
ADACCL_ADACC4_MASK                       equ 0010h
ADACCL_ADACC5_POSN                       equ 0005h
ADACCL_ADACC5_POSITION                   equ 0005h
ADACCL_ADACC5_SIZE                       equ 0001h
ADACCL_ADACC5_LENGTH                     equ 0001h
ADACCL_ADACC5_MASK                       equ 0020h
ADACCL_ADACC6_POSN                       equ 0006h
ADACCL_ADACC6_POSITION                   equ 0006h
ADACCL_ADACC6_SIZE                       equ 0001h
ADACCL_ADACC6_LENGTH                     equ 0001h
ADACCL_ADACC6_MASK                       equ 0040h
ADACCL_ADACC7_POSN                       equ 0007h
ADACCL_ADACC7_POSITION                   equ 0007h
ADACCL_ADACC7_SIZE                       equ 0001h
ADACCL_ADACC7_LENGTH                     equ 0001h
ADACCL_ADACC7_MASK                       equ 0080h
ADACCL_ADACC_POSN                        equ 0000h
ADACCL_ADACC_POSITION                    equ 0000h
ADACCL_ADACC_SIZE                        equ 0008h
ADACCL_ADACC_LENGTH                      equ 0008h
ADACCL_ADACC_MASK                        equ 00FFh
ADACCL_ACC0_POSN                         equ 0000h
ADACCL_ACC0_POSITION                     equ 0000h
ADACCL_ACC0_SIZE                         equ 0001h
ADACCL_ACC0_LENGTH                       equ 0001h
ADACCL_ACC0_MASK                         equ 0001h
ADACCL_ACC1_POSN                         equ 0001h
ADACCL_ACC1_POSITION                     equ 0001h
ADACCL_ACC1_SIZE                         equ 0001h
ADACCL_ACC1_LENGTH                       equ 0001h
ADACCL_ACC1_MASK                         equ 0002h
ADACCL_ACC2_POSN                         equ 0002h
ADACCL_ACC2_POSITION                     equ 0002h
ADACCL_ACC2_SIZE                         equ 0001h
ADACCL_ACC2_LENGTH                       equ 0001h
ADACCL_ACC2_MASK                         equ 0004h
ADACCL_ACC3_POSN                         equ 0003h
ADACCL_ACC3_POSITION                     equ 0003h
ADACCL_ACC3_SIZE                         equ 0001h
ADACCL_ACC3_LENGTH                       equ 0001h
ADACCL_ACC3_MASK                         equ 0008h
ADACCL_ACC4_POSN                         equ 0004h
ADACCL_ACC4_POSITION                     equ 0004h
ADACCL_ACC4_SIZE                         equ 0001h
ADACCL_ACC4_LENGTH                       equ 0001h
ADACCL_ACC4_MASK                         equ 0010h
ADACCL_ACC5_POSN                         equ 0005h
ADACCL_ACC5_POSITION                     equ 0005h
ADACCL_ACC5_SIZE                         equ 0001h
ADACCL_ACC5_LENGTH                       equ 0001h
ADACCL_ACC5_MASK                         equ 0020h
ADACCL_ACC6_POSN                         equ 0006h
ADACCL_ACC6_POSITION                     equ 0006h
ADACCL_ACC6_SIZE                         equ 0001h
ADACCL_ACC6_LENGTH                       equ 0001h
ADACCL_ACC6_MASK                         equ 0040h
ADACCL_ACC7_POSN                         equ 0007h
ADACCL_ACC7_POSITION                     equ 0007h
ADACCL_ACC7_SIZE                         equ 0001h
ADACCL_ACC7_LENGTH                       equ 0001h
ADACCL_ACC7_MASK                         equ 0080h

// Register: ADACCH
#define ADACCH ADACCH
ADACCH                                   equ 03E4h
// bitfield definitions
ADACCH_ACC_POSN                          equ 0000h
ADACCH_ACC_POSITION                      equ 0000h
ADACCH_ACC_SIZE                          equ 0008h
ADACCH_ACC_LENGTH                        equ 0008h
ADACCH_ACC_MASK                          equ 00FFh
ADACCH_ADACC8_POSN                       equ 0000h
ADACCH_ADACC8_POSITION                   equ 0000h
ADACCH_ADACC8_SIZE                       equ 0001h
ADACCH_ADACC8_LENGTH                     equ 0001h
ADACCH_ADACC8_MASK                       equ 0001h
ADACCH_ADACC9_POSN                       equ 0001h
ADACCH_ADACC9_POSITION                   equ 0001h
ADACCH_ADACC9_SIZE                       equ 0001h
ADACCH_ADACC9_LENGTH                     equ 0001h
ADACCH_ADACC9_MASK                       equ 0002h
ADACCH_ADACC10_POSN                      equ 0002h
ADACCH_ADACC10_POSITION                  equ 0002h
ADACCH_ADACC10_SIZE                      equ 0001h
ADACCH_ADACC10_LENGTH                    equ 0001h
ADACCH_ADACC10_MASK                      equ 0004h
ADACCH_ADACC11_POSN                      equ 0003h
ADACCH_ADACC11_POSITION                  equ 0003h
ADACCH_ADACC11_SIZE                      equ 0001h
ADACCH_ADACC11_LENGTH                    equ 0001h
ADACCH_ADACC11_MASK                      equ 0008h
ADACCH_ADACC12_POSN                      equ 0004h
ADACCH_ADACC12_POSITION                  equ 0004h
ADACCH_ADACC12_SIZE                      equ 0001h
ADACCH_ADACC12_LENGTH                    equ 0001h
ADACCH_ADACC12_MASK                      equ 0010h
ADACCH_ADACC13_POSN                      equ 0005h
ADACCH_ADACC13_POSITION                  equ 0005h
ADACCH_ADACC13_SIZE                      equ 0001h
ADACCH_ADACC13_LENGTH                    equ 0001h
ADACCH_ADACC13_MASK                      equ 0020h
ADACCH_ADACC14_POSN                      equ 0006h
ADACCH_ADACC14_POSITION                  equ 0006h
ADACCH_ADACC14_SIZE                      equ 0001h
ADACCH_ADACC14_LENGTH                    equ 0001h
ADACCH_ADACC14_MASK                      equ 0040h
ADACCH_ADACC15_POSN                      equ 0007h
ADACCH_ADACC15_POSITION                  equ 0007h
ADACCH_ADACC15_SIZE                      equ 0001h
ADACCH_ADACC15_LENGTH                    equ 0001h
ADACCH_ADACC15_MASK                      equ 0080h
ADACCH_ADACC_POSN                        equ 0000h
ADACCH_ADACC_POSITION                    equ 0000h
ADACCH_ADACC_SIZE                        equ 0008h
ADACCH_ADACC_LENGTH                      equ 0008h
ADACCH_ADACC_MASK                        equ 00FFh
ADACCH_ACC8_POSN                         equ 0000h
ADACCH_ACC8_POSITION                     equ 0000h
ADACCH_ACC8_SIZE                         equ 0001h
ADACCH_ACC8_LENGTH                       equ 0001h
ADACCH_ACC8_MASK                         equ 0001h
ADACCH_ACC9_POSN                         equ 0001h
ADACCH_ACC9_POSITION                     equ 0001h
ADACCH_ACC9_SIZE                         equ 0001h
ADACCH_ACC9_LENGTH                       equ 0001h
ADACCH_ACC9_MASK                         equ 0002h
ADACCH_ACC10_POSN                        equ 0002h
ADACCH_ACC10_POSITION                    equ 0002h
ADACCH_ACC10_SIZE                        equ 0001h
ADACCH_ACC10_LENGTH                      equ 0001h
ADACCH_ACC10_MASK                        equ 0004h
ADACCH_ACC11_POSN                        equ 0003h
ADACCH_ACC11_POSITION                    equ 0003h
ADACCH_ACC11_SIZE                        equ 0001h
ADACCH_ACC11_LENGTH                      equ 0001h
ADACCH_ACC11_MASK                        equ 0008h
ADACCH_ACC12_POSN                        equ 0004h
ADACCH_ACC12_POSITION                    equ 0004h
ADACCH_ACC12_SIZE                        equ 0001h
ADACCH_ACC12_LENGTH                      equ 0001h
ADACCH_ACC12_MASK                        equ 0010h
ADACCH_ACC13_POSN                        equ 0005h
ADACCH_ACC13_POSITION                    equ 0005h
ADACCH_ACC13_SIZE                        equ 0001h
ADACCH_ACC13_LENGTH                      equ 0001h
ADACCH_ACC13_MASK                        equ 0020h
ADACCH_ACC14_POSN                        equ 0006h
ADACCH_ACC14_POSITION                    equ 0006h
ADACCH_ACC14_SIZE                        equ 0001h
ADACCH_ACC14_LENGTH                      equ 0001h
ADACCH_ACC14_MASK                        equ 0040h
ADACCH_ACC15_POSN                        equ 0007h
ADACCH_ACC15_POSITION                    equ 0007h
ADACCH_ACC15_SIZE                        equ 0001h
ADACCH_ACC15_LENGTH                      equ 0001h
ADACCH_ACC15_MASK                        equ 0080h

